#PANDAS

In [7]:
import random as r
r.randint(1,11)

1

In [10]:
import pandas as pd

In [16]:
a=pd.Series([1,2,3,4],index=['asmit','sushil','ashu','yogesh'])

In [17]:
a[1]

2

In [23]:
pd.Series((1,2,3,4.4))

0       1
1       2
2       3
3     4.4
4    True
dtype: object

In [24]:
import pandas as pd

In [25]:
d={"name":"ASmit","roll":12,"Age":20}
pd.Series(d)

name    ASmit
roll       12
Age        20
dtype: object

In [27]:
a=pd.Series(1,index=[1,2,3,4])
a

1    1
2    1
3    1
4    1
dtype: int64

In [ ]:
#combination of series is dataframe

In [28]:
import pandas as pd

In [29]:
name=pd.Series(["leonard","Sheldon","Amy","Raj"])
salary=pd.Series([1000,20000,3000,3400])

In [37]:
df=pd.DataFrame({"Name":name,"Salary":salary})

In [38]:
df

      Name  Salary
0  leonard    1000
1  Sheldon   20000
2      Amy    3000
3      Raj    3400

In [41]:
#df.columns
for i in df.columns:
    print(i)

Name
Salary

In [45]:
df.shape
df.size
df.index

RangeIndex(start=0, stop=4, step=1)

In [54]:
df2=df[["Name"]].copy()
df2

      Name
0  leonard
1  Sheldon
2      Amy
3      Raj

In [57]:
df[0:1]

      Name  Salary
0  leonard    1000

In [58]:
df[2:4]

  Name  Salary
2  Amy    3000
3  Raj    3400

In [59]:
df

      Name  Salary
0  leonard    1000
1  Sheldon   20000
2      Amy    3000
3      Raj    3400

In [60]:
df.Name

0    leonard
1    Sheldon
2        Amy
3        Raj
Name: Name, dtype: object